{
  "basics": {
    "name": "Ramesh Shah",
    "label": "Student",
    "picture": "https://github.com/iamrames.png",
    "email": "iamrameshshah@gmail.com",
    "phone": "(+977) 9845575551",
    "website": "https://iamrames.github.io",
    "summary": "Results-driven Senior .NET Developer with over 6 years of experience in designing, developing, and implementing innovative software solutions. Proven expertise in full-stack development, database management, and team collaboration. Adept at analyzing complex problems and translating requirements into efficient code. Passionate about staying up to date with the latest technologies to drive project success.",
    "location": { "address": "Purano Makawanpur Road", "postalCode": "", "city": "Hetauda,", "countryCode": "Nepal", "region": "Makawanpur" },
    "profiles": [
      { "network": "github", "username": "iamrames", "url": "http://github.com/iamrames" },
      { "network": "linkedin", "username": "iamrameshshah", "url": "https://www.linkedin.com/in/iamrameshshah/" }
    ]
  },
  // "interests": [
  //   { "name": "Web Development" },
  //   { "name": "Neuromorphic Computing" },
  //   { "name": "Quantum Computing" },
  //   { "name": "Robotics" },
  //   { "name": "3D Graphics" }
  // ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "keywords": [ "C#", ".Net", "Blazor", "Angular", "Python", "EF Core", "Javascript", "jQuery", "SQL", "Dev Express" ]
    },
    {
      "name": "Toolsets",
      "keywords": [ "Git/GitHub", "VS Code", "Docker", "Kubernetes" ]
    },
    {
      "name": "Cloud Platforms",
      "keywords": [ "AWS", "Azure" ]
    }
  ],
  "education": [
    {
      "institution": "Tribhuwan University",
      "area": "Computer Science",
      "studyType": "B.Sc.",
      "startDate": "2016",
      "endDate": "2020",
      "courses": [
      ]
    }
  ],
  "work": [
    {
      "company": "DRESSLER CONSULTING",
      "position": "SENIOR SOFTWARE ENGINEER",
      "website": "",
      "startDate": "10/2021",
      "endDate": "Present",
      "summary": "Lead developer for ANYML project.",
      "highlights": [
        "Lead a cross-functional team in the successful delivery of AnyML.",
        "Utilized Agile methodologies to streamline development processes, resulting in a 20% increase in team productivity.",
        "Collaborated with stakeholders to gather and refine project requirements, ensuring alignment with business objectives.",
        "Implemented best practices in code reviews, reducing the number of bugs by 15%.",
        "Oversaw software development and coded profitable apps using C#, .NET CORE, and Python.",
        "Used different Microservices pattern such as CQRS, Configuration, Externalization, Sidecar, Service Discovery and many more.",
        "Leveraged AWS services like EC2, RDS, VPC, EFS, Route 53, etc. for implementing distributed system."
      ]
    },
    {
      "company": "INFO DEVELOPERS PVT. LTD.",
      "position": "SOFTWARE ENGINEER",
      "website": "",
      "startDate": "07/2019",
      "endDate": "09/2021",
      "summary": "Lead developer for CIT project.",
      "highlights": [
        "Spearheaded the migration of a legacy system to a modern .NET Core framework, resulting in improved performance and scalability.",
        "Developed RESTful APIs for seamless integration with third-party applications.",
        "Conducted regular training sessions for junior developers, contributing to the professional growth of the team.",
        "Contributed to multiple solutions such as CIT (Used by government institutions), COPOMIS (Fintech solution for Department of Cooperatives), Computerized Government Accounting System (CGAS), and many more."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "DANFE SOLUTION",
      "website": "",
      "position": "Software Developer",
      "startDate": "04/2017",
      "endDate": "05/2018",
      "summary": "Lead developer for RestroOrder project",
      "highlights": [
        "Contributed to Restaurant Management System based C# (ASP .Net MVC), JQuery, Sql Server, and Dapper",
        "Working on POS, Order Management, and Inventory Management.",
        "Involved in the SDLC of requirement analysis, design, and development of the web-based application in the fastpaced agile methodology",
        "Collaborated with a team of developers and senior engineers to contribute to the development of web applications using ASP.Net Core.",
        "Developed RESTful APIs and integrated them into the ASP.Net Core application to facilitate data exchange with external systems.",
        "Leveraged the MVC (Model-View-Controller) architectural pattern to create modular and maintainable code structures."
      ]
    }
  ]
}
